testsrc/main/mondrian/xmla/excel_2000/excel_2000_12_in.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Header>
    <XA:Session 
        mustUnderstand="1" 
        SessionId="${session.id}" 
        xmlns:XA="urn:schemas-microsoft-com:xml-analysis" 
    />
  </Header>
  <Body>
    <Discover xmlns="urn:schemas-microsoft-com:xml-analysis">
      <RequestType>MDSCHEMA_MEASURES</RequestType>
      <Restrictions>
        <RestrictionList>
          <CUBE_NAME>This restriction should never match.</CUBE_NAME>
        </RestrictionList>
      </Restrictions>
      <Properties>
        <PropertyList>
          <LocaleIdentifier>1033</LocaleIdentifier>
          <DataSourceInfo>MondrianFoodMart</DataSourceInfo>
          <Catalog>FoodMart</Catalog>
          <Content>SchemaData</Content>
          <Format>Tabular</Format>
        </PropertyList>
      </Properties>
    </Discover>
  </Body>
</Envelope>
